# Сколько слов в строке?

string = input()

print(string.count(' ') + 1)